#include <iostream>

using namespace std;

int main(){
    // Задача: Сложить матрицы A и B
    // Теория: A + B - при сложении матриц складываются элементы с одинаковыми индексами,
    // поэтому у матриц должна быть одинаковая размерность
    int A[3][3] = {
        {12, 95, 1},
        {51, -23, 47},
        {29, 84, 63}
    };
    int B[3][3] = {
        {-1, 31, 4},
        {6, 49, 56},
        {-32, 75, 8}
    };

    // Сложение матриц
    int result[3][3];
    for(int i = 0; i < 3; i++){
        for(int j = 0; j < 3; j++){
            result[i][j] = A[i][j] + B[i][j];
            cout << result[i][j] << " "; // вывод результата
        }
        cout << endl;
    }
}