#include <iostream>

using namespace std;

int main(){
    // Массив - список элементов одного типа

    // Создание
    int arr[5] = {1, 2, 3, 4, 5};
    int vals[10];
    
    // Просмотр
    for(int i = 0; i < 5; i++){
        cout << "Элемент " << i << " = " << arr[i] << endl;
    }

    // Изменение элементов
    arr[2] = 21; // новое значение
    arr[6] = 21; // так нельзя, хотя работать будет. P.s. плохая практика

    // Выводим измененный массив
    for(int i = 0; i < 5; i++){
        cout << "Элемент " << i << " = " << arr[i] << endl;
    
}